zeranemesis/Marioparty4/partyboard/src/REL/m456Dll/stage.c
#include "game/hu3d.h"
#include "game/object.h"
#include "game/objsub.h"
#include "game/sprite.h"

#include "REL/m456Dll.h"

#include "ext_math.h"
#include "version.h"
#include <string.h>

#ifndef __MWERKS__
#include "game/frand.h"
#endif

Process *lbl_1_bss_B8;
omObjData *lbl_1_bss_B4;
omObjData *lbl_1_bss_B0;
omObjData *lbl_1_bss_AC;
omObjData *lbl_1_bss_A8;
omObjData *lbl_1_bss_A4;
omObjData *lbl_1_bss_A0;
Vec lbl_1_bss_94;

typedef struct struct_bss90 {
    ANIMDATA *unk0[4];
    s32 unk10[4];
    Vec unk20;
} StructBss90;

StructBss90 *lbl_1_bss_90;

Vec lbl_1_data_2E8[4] = {
    { -460, 0, 150 },
    { 460, 0, 150 },
    { -460, 0, -150 },
    { 460, 0, -150 },
};

GXColor lbl_1_data_318 = { 255, 255, 255, 255 };

typedef struct struct_data31C {
    s32 unk0;
    s32 unk4;
    s32 unk8;
    s32 unkC;
    BOOL unk10;
} StructData31C;

StructData31C lbl_1_data_31C[4] = {
    { 400, 400, 400, 400, FALSE },
    { 640, 480, 320, 240, TRUE },
    { 640, 480, 640, 480, FALSE },
    { 640, 480, 320, 240, TRUE },
};

void fn_1_89AC(void);

void fn_1_6444(omObjData *object);
void fn_1_6DB0(omObjData *object);
void fn_1_70F0(omObjData *object);
void fn_1_7778(omObjData *object);
void fn_1_841C(omObjData *object);

omObjData *fn_1_2FAC(void);

void fn_1_2DF4(Process *objman)
{
    lbl_1_bss_B8 = objman;
    fn_1_89AC();
    lbl_1_bss_B0 = omAddObjEx(lbl_1_bss_B8, 50, 0, 0, -1, fn_1_6444);
    lbl_1_bss_AC = omAddObjEx(lbl_1_bss_B8, 50, 8, 0, -1, fn_1_6DB0);
    lbl_1_bss_A8 = omAddObjEx(lbl_1_bss_B8, 50, 1, 0, -1, fn_1_70F0);
    lbl_1_bss_A4 = omAddObjEx(lbl_1_bss_B8, 50, 0, 0, -1, fn_1_7778);
    lbl_1_bss_A0 = omAddObjEx(lbl_1_bss_B8, 50, 0, 0, -1, fn_1_841C);
    lbl_1_bss_B4 = fn_1_2FAC();
}

void fn_1_3C34(omObjData *object);

void fn_1_6790(omObjData *object);
void fn_1_6F60(omObjData *object);
void fn_1_74A4(omObjData *object);
void fn_1_7F74(omObjData *object);

void fn_1_8C68(void);

void fn_1_2F3C(void)
{
    fn_1_3C34(lbl_1_bss_B4);
    fn_1_8C68();
    fn_1_6790(lbl_1_bss_B0);
    fn_1_6F60(lbl_1_bss_AC);
    fn_1_74A4(lbl_1_bss_A8);
    fn_1_7F74(lbl_1_bss_A4);
}

// same struct as Work347CUnk4 which is in m455
typedef struct work_2FAC_unk4 {
    void *bmpData;
    u32 unk4;
    BOOL unk8;
    s32 unkC;
    s32 unk10;
    s32 sizeX;
    s32 sizeY;
} Work2FACUnk4;

typedef struct work_2FAC_unk74 {
    Vec unk0;
    Vec unkC;
    float unk18;
    u16 unk1C;
    u16 unk1E;
} Work2FACUnk74;

typedef struct work_2FAC {
    s32 unk0;
    Work2FACUnk4 unk4[4];
    Work2FACUnk74 unk74[64];
    float unk874[26][2];
    float unk944[26][2];
    void *unkA14;
    u32 unkA18;
    ANIMDATA *unkA1C[9];
    float unkA40;
    float unkA44;
    u32 unkA48;
    u32 unkA4C;
    u32 unkA50;
    float unkA54;
    float unkA58;
} Work2FAC;

void fn_1_390C(omObjData *object);

void fn_1_3CB0(HU3DMODEL *model, Mtx matrix);
void fn_1_44DC(HU3DMODEL *model, Mtx matrix);
void fn_1_4994(HU3DMODEL *model, Mtx matrix);

omObjData *fn_1_2FAC(void)
{
    omObjData *object = omAddObjEx(lbl_1_bss_B8, 127, 15, 0, -1, fn_1_390C);
    Work2FAC *work = object->data = HuMemDirectMallocNum(HEAP_SYSTEM, sizeof(Work2FAC), MEMORY_DEFAULT_NUM);
    Work2FAC *work2 = work;
    Work2FACUnk74 *workUnk74 = &work->unk74[0];
    Work2FACUnk4 *workUnk4;
    s32 id;
    HU3DMODEL *modelP;
    s32 i;

    work->unkA40 = 0;
    work->unkA44 = 0;
    work->unkA48 = 0;
    work->unkA4C = 0;
    work->unkA50 = 0;
    work->unkA54 = 0;
    work->unkA58 = 0;

    object->model[0] = id = Hu3DHookFuncCreate(fn_1_4994);
    Hu3DModelCameraSet(id, HU3D_CAM0);
    Hu3DModelLayerSet(id, 5);
    modelP = &Hu3DData[id];
    modelP->hookData = work;
    work->unkA1C[4] = HuSprAnimRead(HuDataReadNum(DATA_MAKE_NUM(DATADIR_M456, 21), MEMORY_DEFAULT_NUM));
    work->unkA1C[5] = HuSprAnimRead(HuDataReadNum(DATA_MAKE_NUM(DATADIR_M456, 22), MEMORY_DEFAULT_NUM));
    work->unkA1C[6] = HuSprAnimRead(HuDataReadNum(DATA_MAKE_NUM(DATADIR_M456, 23), MEMORY_DEFAULT_NUM));
    work->unkA1C[7] = HuSprAnimRead(HuDataReadNum(DATA_MAKE_NUM(DATADIR_M456, 24), MEMORY_DEFAULT_NUM));
    work->unkA1C[0] = HuSprAnimRead(HuDataReadNum(DATA_MAKE_NUM(DATADIR_M456, 17), MEMORY_DEFAULT_NUM));
    work->unkA1C[1] = HuSprAnimRead(HuDataReadNum(DATA_MAKE_NUM(DATADIR_M456, 18), MEMORY_DEFAULT_NUM));
    work->unkA1C[2] = HuSprAnimRead(HuDataReadNum(DATA_MAKE_NUM(DATADIR_M456, 19), MEMORY_DEFAULT_NUM));
    work->unkA1C[3] = HuSprAnimRead(HuDataReadNum(DATA_MAKE_NUM(DATADIR_M456, 20), MEMORY_DEFAULT_NUM));
    work->unkA1C[8] = HuSprAnimRead(HuDataReadNum(DATA_MAKE_NUM(DATADIR_M456, 25), MEMORY_DEFAULT_NUM));
    object->model[1] = id = Hu3DHookFuncCreate(fn_1_3CB0);
    Hu3DModelCameraSet(id, HU3D_CAM0);
    Hu3DModelLayerSet(id, 0);
    modelP = &Hu3DData[id];
    modelP->hookData = work;
    work2->unkA18 = 16384;
    work2->unkA14 = HuMemDirectMallocNum(HEAP_SYSTEM, work2->unkA18, MEMORY_DEFAULT_NUM);
    DCFlushRange(work2->unkA14, 16384);
    GXBeginDisplayList(work2->unkA14, work2->unkA18);
    GXBegin(GX_QUADS, GX_VTXFMT0, 4);
    GXPosition2f32(-0.5f, -0.5f);
    GXTexCoord2f32(0, 0);
    GXPosition2f32(0.5f, -0.5f);
    GXTexCoord2f32(1, 0);
    GXPosition2f32(0.5f, 0.5f);
    GXTexCoord2f32(1, 1);
    GXPosition2f32(-0.5f, 0.5f);
    GXTexCoord2f32(0, 1);
    GXEnd();
    work2->unkA18 = GXEndDisplayList();
    for (i = 0; i < 26; i++) {
        work2->unk874[i][0] = 0;
        work2->unk874[i][1] = 0;
        work2->unk944[i][0] = 0;
        work2->unk944[i][1] = 0;
    }

    object->model[3] = id = Hu3DModelCreateFile(DATA_MAKE_NUM(DATADIR_M456, 5));
    Hu3DModelPosSet(id, 0, 0, -5000);
    Hu3DModelScaleSet(id, 2, 2, 2);
    Hu3DModelCameraSet(id, HU3D_CAM0);
    Hu3DModelLayerSet(id, 1);
    id = Hu3DTexScrollCreate(object->model[3], "S3TCsk");
    Hu3DTexScrollPosMoveSet(id, -0.0055f*(1.0f/REFRESH_RATE), 0, 0);
    id = Hu3DTexScrollCreate(object->model[3], "pa_sk3");
    Hu3DTexScrollPosMoveSet(id, -0.0125f*(1.0f/REFRESH_RATE), 0, 0);

    object->model[4] = id = Hu3DModelCreateFile(DATA_MAKE_NUM(DATADIR_M456, 6));
    Hu3DModelPosSet(id, 0, 0, -3000);
    Hu3DModelScaleSet(id, 1.2f, 1.2f, 1.2f);
    Hu3DModelCameraSet(id, HU3D_CAM0);
    Hu3DModelLayerSet(id, 1);

    object->model[8] = id = Hu3DHookFuncCreate(fn_1_44DC);
    Hu3DModelCameraSet(id, HU3D_CAM0);
    Hu3DModelLayerSet(id, 2);
    modelP = &Hu3DData[id];
    modelP->hookData = work;

    object->model[10] = id = Hu3DModelCreateFile(DATA_MAKE_NUM(DATADIR_M456, 0));
    Hu3DModelPosSet(id, 0, 0, 0);
    Hu3DModelCameraSet(id, HU3D_CAM0);
    Hu3DModelLayerSet(id, 3);
    Hu3DModelShadowMapSet(object->model[10]);
    for (i = 0; i < 4; i++) {

        object->model[i + 11] = id = Hu3DModelCreateFile(DATA_MAKE_NUM(DATADIR_M456, 1));
        Hu3DModelCameraSet(object->model[i + 11], HU3D_CAM0);
        Hu3DModelLayerSet(object->model[i + 11], 3);
        Hu3DModelPosSet(object->model[i + 11], lbl_1_data_2E8[i].x, lbl_1_data_2E8[i].y, lbl_1_data_2E8[i].z);
        Hu3DModelAttrSet(object->model[i + 11], HU3D_MOTATTR_SHAPE_LOOP);
        Hu3DMotionShapeTimeSet(object->model[i + 11], (0.25 * i) * Hu3DMotionShapeMaxTimeGet(object->model[i + 11]));
    }
    modelP = &Hu3DData[object->model[0]];
    workUnk4 = &work2->unk4[0];
    for (i = 0; i < 4; i++, workUnk4++) {
        workUnk4->unkC = lbl_1_data_31C[i].unk0;
        workUnk4->unk10 = lbl_1_data_31C[i].unk4;
        workUnk4->sizeX = lbl_1_data_31C[i].unk8;
        workUnk4->sizeY = lbl_1_data_31C[i].unkC;
        workUnk4->unk8 = lbl_1_data_31C[i].unk10;
        workUnk4->unk4 = GXGetTexBufferSize(workUnk4->sizeX, workUnk4->sizeY, GX_TF_RGB565, GX_FALSE, GX_FALSE);
        workUnk4->bmpData = HuMemDirectMallocNum(HEAP_DATA, workUnk4->unk4, modelP->mallocNo);
        memset(workUnk4->bmpData, 0, workUnk4->unk4);
        DCFlushRange(workUnk4->bmpData, workUnk4->unk4);
    }
    for (i = 0; i < 64; i++, workUnk74++) {
        workUnk74->unk0.x = workUnk74->unk0.y = workUnk74->unk0.z = 0;
        workUnk74->unkC.x = 0;
        workUnk74->unkC.y = 0;
        workUnk74->unkC.z = 1;
        workUnk74->unk18 = 1.0f / REFRESH_RATE;
        workUnk74->unk1C = REFRESH_RATE;
        workUnk74->unk1E = 0;
    }
    return object;
}

