zeranemesis/Marioparty4/partyboard/src/REL/m456Dll/stage.c
void fn_1_97FC(float arg0);

void fn_1_390C(omObjData *object)
{
    Work2FAC *work = object->data;
    Work2FAC *work2 = work;
    s32 i;
    if ((work->unkA50 = work->unkA50 + (0.007874016f * ((s32)frand() & 0x7F) * 3.0f)) > 360) {
        work->unkA50 -= 360;
    }
    work->unkA44 = (25 + work->unkA40) + (5.0 * sind(work->unkA50));
    Hu3DModelPosSet(object->model[10], 0, work->unkA44, 0);
    for (i = 0; i < 4; i++) {
        Hu3DModelPosSet(object->model[i + 11], lbl_1_data_2E8[i].x, work->unkA44 + lbl_1_data_2E8[i].y, lbl_1_data_2E8[i].z);
    }
    work->unkA54 += 0.3f*(0.2f/REFRESH_RATE); // 0.06f / REFRESH_RATE
    work->unkA58 += 0.3f*(0.2f/REFRESH_RATE);
    work->unkA48++;
    work->unkA4C++;
    if (work->unkA4C >= (float)REFRESH_RATE && work->unkA4C <= (REFRESH_RATE*1.35f)) {
        float time = 1 - ((work->unkA4C - (float)REFRESH_RATE) / (REFRESH_RATE*0.35f));
        if (time < 0.0f) {
            time = 0.0f;
        }
        fn_1_97FC(time);
    }
}

void fn_1_3C34(omObjData *object)
{
    Work2FAC *work = object->data;
    HuSprAnimKill(work->unkA1C[0]);
    HuSprAnimKill(work->unkA1C[1]);
    HuSprAnimKill(work->unkA1C[2]);
    HuSprAnimKill(work->unkA1C[3]);
    HuSprAnimKill(work->unkA1C[6]);
    HuSprAnimKill(work->unkA1C[7]);
    HuSprAnimKill(work->unkA1C[4]);
    HuSprAnimKill(work->unkA1C[5]);
    HuSprAnimKill(work->unkA1C[8]);
}

GXColor lbl_1_data_37A = { 255, 255, 255, 32 };
GXColor lbl_1_data_37E = { 255, 255, 255, 10 };
GXColor lbl_1_data_382 = { 0, 126, 126, 255 };
Vec lbl_1_data_388[4] = { -1000, 50, 1000, -1000, 50, -1000, 1000, 50, -1000, 1000, 50, 1000 };

Vec lbl_1_data_3B8[26] = { -1500, 0, 1000, -1400, 0, 1000, 0, 0, 1000, 1400, 0, 1000, 1500, 0, 1000, -1500, 0, -500, -1400, 0, -500, 0, 0, -500, 1400,
    0, -500, 1500, 0, -500, -1500, 0, -2000, -1400, 0, -2000, 0, 0, -2000, 1400, 0, -2000, 1500, 0, -2000, -1500, 0, -5000, -1400, 0, -5000, 0, 0,
    -5000, 1400, 0, -5000, 1500, 0, -5000, -2000, 0, -500, -2500, 0, -2000, -3000, 0, -5000, 2000, 0, -500, 2500, 0, -2000, 3000, 0, -5000 };

GXColor lbl_1_data_4F0[26] = { { 96, 128, 255, 255 }, { 128, 160, 255, 32 }, { 128, 160, 255, 32 }, { 128, 160, 255, 32 }, { 96, 128, 255, 255 },
    { 24, 48, 255, 255 }, { 96, 128, 255, 32 }, { 128, 160, 255, 32 }, { 96, 128, 255, 32 }, { 24, 48, 255, 255 }, { 24, 48, 255, 255 },
    { 24, 48, 255, 255 }, { 96, 128, 255, 255 }, { 24, 48, 255, 255 }, { 24, 48, 255, 255 }, { 8, 24, 143, 255 }, { 8, 24, 143, 255 },
    { 8, 24, 143, 255 }, { 8, 24, 143, 255 }, { 8, 24, 143, 255 }, { 24, 48, 255, 255 }, { 24, 48, 255, 255 }, { 24, 48, 255, 255 },
    { 24, 48, 255, 255 }, { 24, 48, 255, 255 }, { 24, 48, 255, 255 } };

float lbl_1_data_558[26][2]
    = { 0, 1, 0.033333335, 1, 0.5, 1, 0.96666664, 1, 1, 1, 0, 0.5, 0.033333335, 0.5, 0.5, 0.5, 0.96666664, 0.5, 1, 0.5, 0, 0, 0.033333335, 0, 0.5, 0,
          0.96666664, 0, 1, 0, 0, 0, 0.033333335, 0, 0.5, 0, 0.96666664, 0, 1, 0, -0.15, 0.5, -0.33, 0, -0.49, 0, 1.15, 0.5, 1.33, 0, 1.49, 0 };

float lbl_1_data_628[26][2] = { 0, 30, 0.5, 30, 7.5, 30, 14.5, 30, 15, 30, 0, 15, 0.5, 15, 7.5, 15, 14.5, 15, 15, 15, 0, 7.5, 0.5, 7.5, 7.5, 7.5,
    14.5, 7.5, 15, 7.5, 0, 0, 0.5, 0, 7.5, 0, 14.5, 0, 15, 0, -2.25, 15, -4.9500003, 7.5, -7.3500004, 0, 17.25, 15, 19.95, 7.5, 22.35, 0 };

float lbl_1_data_6F8[2][3] = { 0, 0, 0.5, 0, 0.5, 0 };

GXColor lbl_1_data_710 = { 80, 80, 80, 80 };

Vec lbl_1_data_714[9]
    = { -1500, 0, -5000, 0, 0, -5000, 1500, 0, -5000, -1500, 0, -3000, 0, 0, -3000, 1500, 0, -3000, -1500, 0, 1000, 0, 0, 1000, 1500, 0, 1000 };

GXColor lbl_1_data_780[9] = {
    { 255, 255, 255, 0 },
    { 255, 255, 255, 0 },
    { 255, 255, 255, 0 },
    { 255, 255, 255, 0 },
    { 255, 255, 255, 255 },
    { 255, 255, 255, 0 },
    { 255, 255, 255, 0 },
    { 255, 255, 255, 255 },
    { 255, 255, 255, 0 },
};

GXColor lbl_1_data_7A4 = { 255, 165, 89, 178 };
GXColor lbl_1_data_7A8 = { 153, 114, 89, 178 };
GXColor lbl_1_data_7AC = { 0, 0, 0, 255 };

void fn_1_5BB8(Work2FACUnk4 *arg0, s32 arg1);

void fn_1_3CB0(HU3DMODEL *model, Mtx matrix)
{
    Work2FAC *work = model->hookData;
    Work2FAC *work2 = work;
    Work2FACUnk74 *workUnk74 = &work2->unk74[0];
    Work2FACUnk4 *workUnk4 = &work2->unk4[0];
    s32 i;
#ifdef NON_MATCHING
    Mtx44 proj;
#else
    Mtx proj;
#endif
    Mtx modelview;
    MTXOrtho(proj, 0, 480, 0, 640, 0, 100);
    GXSetProjection(proj, GX_ORTHOGRAPHIC);
    MTXIdentity(modelview);
    GXLoadPosMtxImm(modelview, GX_PNMTX0);
    GXSetNumChans(1);
    GXSetChanCtrl(GX_COLOR0A0, GX_FALSE, GX_SRC_REG, GX_SRC_REG, 0, GX_DF_CLAMP, GX_AF_NONE);
    GXSetChanMatColor(GX_COLOR0A0, lbl_1_data_382);
    GXSetTevColor(GX_TEVREG0, lbl_1_data_37E);
    GXSetNumTexGens(1);
    GXSetTexCoordGen(GX_TEXCOORD0, GX_TG_MTX2x4, GX_TG_TEX0, GX_IDENTITY);
    GXSetBlendMode(GX_BM_BLEND, GX_BL_SRCALPHA, GX_BL_INVSRCALPHA, GX_LO_NOOP);
    GXSetZMode(GX_FALSE, GX_LEQUAL, GX_FALSE);
    GXSetAlphaCompare(GX_ALWAYS, 0, GX_AOP_AND, GX_ALWAYS, 0);
    GXSetNumTevStages(1);
    GXSetTevOrder(GX_TEVSTAGE0, GX_TEXCOORD0, GX_TEXMAP0, GX_COLOR0A0);
    GXSetTevOp(GX_TEVSTAGE0, GX_PASSCLR);
    GXSetTevColorIn(GX_TEVSTAGE0, GX_CC_RASC, GX_CC_TEXC, GX_CC_A0, GX_CC_ZERO);
    GXSetTevColorOp(GX_TEVSTAGE0, GX_TEV_ADD, GX_TB_ZERO, GX_CS_SCALE_1, GX_TRUE, GX_TEVPREV);
    GXSetTevAlphaIn(GX_TEVSTAGE0, GX_CA_ZERO, GX_CA_ZERO, GX_CA_ZERO, GX_CA_KONST);
    GXSetTevAlphaOp(GX_TEVSTAGE0, GX_TEV_ADD, GX_TB_ZERO, GX_CS_SCALE_1, GX_TRUE, GX_TEVPREV);
    GXSetScissor(0, 0, 400, 400);
    HuSprTexLoad(work->unkA1C[4], 0, 0, GX_REPEAT, GX_REPEAT, GX_LINEAR);
    GXClearVtxDesc();
    GXSetVtxDesc(GX_VA_POS, GX_DIRECT);
    GXSetVtxAttrFmt(GX_VTXFMT0, GX_VA_POS, GX_POS_XY, GX_U16, 0);
    GXSetVtxDesc(GX_VA_TEX0, GX_DIRECT);
    GXSetVtxAttrFmt(GX_VTXFMT0, GX_VA_TEX0, GX_TEX_ST, GX_F32, 0);
    GXBegin(GX_QUADS, GX_VTXFMT0, 4);
    GXPosition2u16(0, 0);
    GXTexCoord2f32(work->unkA54, work->unkA58);
    GXPosition2u16(400, 0);
    GXTexCoord2f32(work->unkA54 + 7, work->unkA58);
    GXPosition2u16(400, 400);
    GXTexCoord2f32(work->unkA54 + 7, work->unkA58 + 7);
    GXPosition2u16(0, 400);
    GXTexCoord2f32(work->unkA54, work->unkA58 + 7);
    GXEnd();
    GXSetNumTexGens(1);
    GXSetTexCoordGen(GX_TEXCOORD0, GX_TG_MTX2x4, GX_TG_TEX0, GX_IDENTITY);
    GXSetNumTevStages(1);
    GXSetTevOrder(GX_TEVSTAGE0, GX_TEXCOORD0, GX_TEXMAP0, GX_COLOR0A0);
    GXSetTevOp(GX_TEVSTAGE0, GX_REPLACE);
    GXSetTevColorIn(GX_TEVSTAGE0, GX_CC_ZERO, GX_CC_ZERO, GX_CC_ZERO, GX_CC_TEXC);
    GXSetTevColorOp(GX_TEVSTAGE0, GX_TEV_ADD, GX_TB_ZERO, GX_CS_SCALE_1, GX_TRUE, GX_TEVPREV);
    GXSetTevAlphaIn(GX_TEVSTAGE0, GX_CA_ZERO, GX_CA_TEXA, GX_CA_RASA, GX_CA_ZERO);
    GXSetTevAlphaOp(GX_TEVSTAGE0, GX_TEV_ADD, GX_TB_ZERO, GX_CS_SCALE_1, GX_TRUE, GX_TEVPREV);
    GXSetBlendMode(GX_BM_BLEND, GX_BL_SRCALPHA, GX_BL_INVSRCALPHA, GX_LO_NOOP);
    HuSprTexLoad(work->unkA1C[8], 0, 0, GX_REPEAT, GX_REPEAT, GX_LINEAR);
    GXClearVtxDesc();
    GXSetVtxAttrFmt(GX_VTXFMT0, GX_VA_POS, GX_POS_XY, GX_F32, 0);
    GXSetVtxDesc(GX_VA_POS, GX_DIRECT);
    GXSetVtxAttrFmt(GX_VTXFMT0, GX_VA_TEX0, GX_TEX_ST, GX_F32, 0);
    GXSetVtxDesc(GX_VA_TEX0, GX_DIRECT);
    workUnk74 = &work2->unk74[0];
    for (i = 0; i < 64; i++, workUnk74++) {
        float scale;
        float accel;
        if (workUnk74->unk1E == 0) {
            continue;
        }
        scale = 128 * (workUnk74->unkC.x * (0.2f + cosd(workUnk74->unk1E * workUnk74->unk18 * 90.0f)));
        accel = workUnk74->unk1E * workUnk74->unk18;
        lbl_1_data_37A.a = workUnk74->unkC.z * sind((accel * accel) * 90.0f) * 255.0;
        GXSetChanMatColor(GX_COLOR0A0, lbl_1_data_37A);
        MTXScale(modelview, 0.5f * scale, 0.5f * scale, 1.0f);
        mtxRotCat(modelview, 0, 0, workUnk74->unkC.y);
        mtxTransCat(modelview, 400 * (workUnk74->unk0.x + 1500) / 3000, 400 * (workUnk74->unk0.z - -2000) / 3000, 0);
        GXLoadPosMtxImm(modelview, GX_PNMTX0);
        GXCallDisplayList(work2->unkA14, work2->unkA18);
        if (!omPauseChk()) {
            workUnk74->unk1E--;
        }
    }
    workUnk4 = &work2->unk4[0];
    fn_1_5BB8(workUnk4, 1);
}

void fn_1_54D0(HU3DMODEL *model, Mtx matrix);

void fn_1_44DC(HU3DMODEL *model, Mtx matrix)
{
    Work2FAC *work;
    Work2FAC *work2;
    Work2FACUnk4 *workUnk4;
    fn_1_54D0(model, matrix);
    work = model->hookData;
    work2 = work;
    workUnk4 = &work2->unk4[1];
    fn_1_5BB8(workUnk4, 0);
}

void fn_1_5C74(Work2FACUnk4 *arg0, float arg1, float arg2, float arg3);

void fn_1_4544(HU3DMODEL *model, Mtx matrix)
{
    Work2FAC *work = model->hookData;
    Work2FAC *work2 = work;
    Work2FACUnk4 *workUnk4 = &work2->unk4[0];

    fn_1_5C74(workUnk4, 200, 0, 0.5f);
    workUnk4 = &work2->unk4[1];
    fn_1_5C74(workUnk4, 0, 0, 0.5f);
    workUnk4 = &work2->unk4[2];
    fn_1_5C74(workUnk4, 0, 150, 0.25f);
    workUnk4 = &work2->unk4[3];
    fn_1_5C74(workUnk4, 0, 300, 0.5f);
}

