zeranemesis/Marioparty4/partyboard/src/REL/m456Dll/stage.c
typedef struct work6914 {
    s32 unk0;
    s32 unk4;
    s32 unk8;
    s32 unkC;
    ANIMDATA *unk10;
    Vec unk14;
    Vec unk20;
    Vec unk2C;
} Work6914;

void fn_1_659C(omObjData *object);

void fn_1_6444(omObjData *object)
{
    Work6914 *work;
    s32 i;
    ANIMDATA *anim;
    work = object->data = HuMemDirectMallocNum(HEAP_SYSTEM, sizeof(Work6914) * 8, MEMORY_DEFAULT_NUM);
    memset(work, 0, sizeof(Work6914) * 8);
    anim = HuSprAnimRead(HuDataReadNum(DATA_MAKE_NUM(DATADIR_M456, 26), MEMORY_DEFAULT_NUM));
    for (i = 0; i < 8; i++, work++) {
        work->unk10 = anim;
        work->unk0 = i;
        work->unk4 = Hu3DParticleCreate(work->unk10, 32);
        Hu3DModelCameraSet(work->unk4, HU3D_CAM0);
        Hu3DModelLayerSet(work->unk4, 6);
        Hu3DModelAttrSet(work->unk4, HU3D_ATTR_DISPOFF);
        Hu3DModelAttrReset(work->unk4, HU3D_ATTR_PARTICLE_KILL);
        work->unk8 = 0;
        work->unkC = 0;
        work->unk14.x = work->unk14.y = work->unk14.z = 0;
        work->unk20.x = work->unk20.y = work->unk20.z = 0;
        work->unk2C.x = work->unk2C.y = work->unk2C.z = 1;
    }
    object->func = fn_1_659C;
}

void fn_1_659C(omObjData *object)
{
    Work6914 *work = object->data;
    s32 i;
    for (i = 0; i < 8; i++, work++) {
        if (work->unk8 == 0) {
            continue;
        }
        if (work->unkC > 1) {
            HU3DMODEL *modelP = &Hu3DData[work->unk4];
            HU3DPARTICLE *particleP = modelP->hookData;
            HU3DPARTICLEDATA *data = particleP->data;
            s32 j;
            for (j = 0; j < particleP->maxCnt; j++, data++) {
                if (++data->time > data->parManId) {
                    s32 alpha = data->color.a - 1;
                    if (alpha < 0) {
                        data->scale = 0;
                    }
                    else {
                        data->color.a = alpha;
                    }
                }
                data->scale *= 0.975;
                data->pos.x += data->vel.x;
                data->pos.y += data->vel.y;
                data->pos.z += data->vel.z;
                data->vel.y -= 0.3103333379576603;
            }
        }
        if (++work->unkC > (1.5f * REFRESH_RATE)) {
            Hu3DModelAttrSet(work->unk4, HU3D_ATTR_DISPOFF);
            work->unk8 = 0;
        }
        else {
            Hu3DModelPosSet(work->unk4, work->unk14.x, work->unk14.y, work->unk14.z);
            Hu3DModelRotSet(work->unk4, work->unk20.x, work->unk20.y, work->unk20.z);
            Hu3DModelScaleSet(work->unk4, work->unk2C.x, work->unk2C.y, work->unk2C.z);
        }
    }
}

void fn_1_6790(omObjData *object)
{
    Work6914 *work = object->data;
    ANIMDATA *anim = work->unk10;
    anim->useNum = 0;
    HuSprAnimKill(anim);
}

s32 fn_1_67E0(Vec *arg0, float arg1)
{
    Work6914 *work = lbl_1_bss_B0->data;
    s32 i;
    HU3DMODEL *temp_r27;
    HU3DPARTICLE *temp_r28;
    HU3DPARTICLEDATA *temp_r30;

    for (i = 0; i < 8; i++, work++) {
        if (work->unk8 == 0) {
            break;
        }
    }
    if (i >= 8) {
        return -1;
    }
    Hu3DModelAttrReset(work->unk4, HU3D_ATTR_DISPOFF);
    work->unk8 = 1;
    work->unkC = 0;
    temp_r27 = &Hu3DData[work->unk4];
    temp_r28 = temp_r27->hookData;
    temp_r28->blendMode = 1;
    temp_r30 = temp_r28->data;
    for (i = 0; i < temp_r28->maxCnt; i++, temp_r30++) {
        float temp_f30 = ((s32)frand() % 20) + 90;
        float temp_f29 = (s32)frand() % 360;
        float temp_f26 = sind(temp_f30);
        float temp_f28 = cosd(temp_f30);
        float temp_f25 = 0.75f + 0.15f * (0.007874016f * ((s32)frand() & 0x7F));
        float temp_f31 = 0.15f;
        temp_r30->vel.x = temp_f31 * (0.65f * (50.0 * (temp_f28 * sind(temp_f29))));
        temp_r30->vel.z = temp_f31 * (0.65f * (50.0 * (temp_f28 * cosd(temp_f29))));
        temp_r30->vel.y = temp_f31 * (50 * temp_f26 * temp_f25);
        temp_r30->time = 0;
        temp_r30->parManId = ((s32)frand() % 16) + 45;
        temp_r30->zRot = (s32)frand() % 360;
        temp_r30->scale = 145.0f;
        temp_r30->pos.x = 0.05f * (((s32)frand() & 0x7F) - 64);
        temp_r30->pos.y = 0.65f * (((s32)frand() & 0x7F) - 64);
        temp_r30->pos.z = 0.05f * (((s32)frand() & 0x7F) - 64);
        temp_r30->color.r = ((s32)frand() % 64) + 192;
        temp_r30->color.g = ((s32)frand() % 64) + 192;
        temp_r30->color.b = ((s32)frand() % 64) + 192;
        temp_r30->color.a = 64;
    }
    if (arg1 < 0.0f) {
        arg1 = 1.0f;
    }
    work->unk14 = *arg0;
    work->unk20.x = work->unk20.y = work->unk20.z = 0;
    work->unk2C.x = work->unk2C.y = work->unk2C.z = arg1;
    Hu3DModelPosSet(work->unk4, work->unk14.x, work->unk14.y, work->unk14.z);
    Hu3DModelRotSet(work->unk4, work->unk20.x, work->unk20.y, work->unk20.z);
    Hu3DModelScaleSet(work->unk4, work->unk2C.x, work->unk2C.y, work->unk2C.z);
    return i;
}

void fn_1_6E98(omObjData *object);

void fn_1_6DB0(omObjData *object)
{
    s32 i;
    for (i = 0; i < object->mdlcnt; i++) {
        if (i == 0) {
            object->model[i] = Hu3DModelCreateFile(DATA_MAKE_NUM(DATADIR_M456, 9));
        }
        else {
            object->model[i] = Hu3DModelLink(object->model[0]);
        }
        Hu3DModelCameraSet(object->model[i], HU3D_CAM0);
        Hu3DModelLayerSet(object->model[i], 6);
        Hu3DModelAttrSet(object->model[i], HU3D_ATTR_DISPOFF);
    }
    object->stat |= 0x100;
    object->func = fn_1_6E98;
}

void fn_1_6E98(omObjData *object)
{
    s32 i;
    for (i = 0; i < object->mdlcnt; i++) {
        HU3DMODEL *modelP = &Hu3DData[object->model[i]];
        if (!(modelP->attr & HU3D_ATTR_DISPOFF)) {
            if (Hu3DMotionTimeGet(object->model[i]) >= Hu3DMotionMaxTimeGet(object->model[i])) {
                Hu3DModelAttrSet(object->model[i], HU3D_ATTR_DISPOFF);
            }
        }
    }
}

void fn_1_6F60(omObjData *object) { }

s32 fn_1_6F64(Vec *pos, float scale)
{
    s32 i;
    for (i = 0; i < lbl_1_bss_AC->mdlcnt; i++) {
        HU3DMODEL *modelP = &Hu3DData[lbl_1_bss_AC->model[i]];
        if (modelP->attr & HU3D_ATTR_DISPOFF) {
            break;
        }
    }
    if (i >= lbl_1_bss_AC->mdlcnt) {
        return -1;
    }
    Hu3DMotionTimeSet(lbl_1_bss_AC->model[i], 0);
    Hu3DMotionSpeedSet(lbl_1_bss_AC->model[i], 1);
    Hu3DModelPosSet(lbl_1_bss_AC->model[i], pos->x, pos->y, pos->z);
    Hu3DModelScaleSet(lbl_1_bss_AC->model[i], scale, scale, scale);
    Hu3DModelAttrReset(lbl_1_bss_AC->model[i], HU3D_ATTR_DISPOFF);
    return i;
}

void fn_1_71E0(omObjData *object);

void fn_1_70F0(omObjData *object)
{
    HU3DPARTICLE *temp_r30;
    HU3DPARTICLEDATA *temp_r29;
    s32 i;
    HU3DMODEL *modelP;
    ANIMDATA *anim = HuSprAnimRead(HuDataReadNum(DATA_MAKE_NUM(DATADIR_M456, 26), MEMORY_DEFAULT_NUM));

    object->data = anim;
    object->model[0] = Hu3DParticleCreate(anim, 64);
    Hu3DModelCameraSet(object->model[0], HU3D_CAM0);
    Hu3DModelLayerSet(object->model[0], 3);
    Hu3DModelAttrReset(object->model[0], HU3D_ATTR_PARTICLE_KILL);
    modelP = &Hu3DData[object->model[0]];
    temp_r30 = modelP->hookData;
    temp_r29 = temp_r30->data;
    temp_r30->blendMode = 1;
    for (i = 0; i < temp_r30->maxCnt; i++, temp_r29++) {
        temp_r29->scale = 0;
    }
    object->func = fn_1_71E0;
}

void fn_1_71E0(omObjData *object)
{
    HU3DMODEL *modelP = &Hu3DData[object->model[0]];
    HU3DPARTICLE *temp_r29 = modelP->hookData;
    HU3DPARTICLEDATA *temp_r30 = temp_r29->data;
    s32 i;
    for (i = 0; i < temp_r29->maxCnt; i++, temp_r30++) {
        if (temp_r30->scale <= 0.0f) {
            continue;
        }
        if (++temp_r30->time > 360) {
            temp_r30->time -= 360;
        }
        temp_r30->pos.x += temp_r30->vel.x * sind(2.0f * temp_r30->time);
        temp_r30->pos.y += temp_r30->vel.y;
        if (temp_r30->pos.y >= 0.0f) {
            fn_1_61C8(&temp_r30->pos, 0.00625f * temp_r30->scale, 1, REFRESH_RATE / 4);
            temp_r30->scale = 0;
        }
    }
}

void fn_1_74A4(omObjData *object)
{
    ANIMDATA *anim = object->data;
    HuSprAnimKill(anim);
    Hu3DModelKill(object->model[0]);
    object->model[0] = -1;
}

s32 fn_1_74F8(Vec *pos, float scale)
{
    s32 i;
    HU3DMODEL *modelP = &Hu3DData[lbl_1_bss_A8->model[0]];
    HU3DPARTICLE *temp_r30 = modelP->hookData;
    HU3DPARTICLEDATA *temp_r31 = temp_r30->data;
    for (i = 0; i < temp_r30->maxCnt; i++, temp_r31++) {
        if (temp_r31->scale <= 0.0f) {
            break;
        }
    }
    if (i >= temp_r30->maxCnt) {
        return -1;
    }
    if (scale <= 0.0f) {
        scale = 1.0f;
    }
    temp_r31->pos = *pos;
    temp_r31->vel.x = ((60.0f/REFRESH_RATE) * (1.5f + (0.2f * (0.007874016f * (frand() & 0x7F))))) * 0.5f;
    temp_r31->vel.z = (1.5f + (0.2f * (0.007874016f * (frand() & 0x7F)))) * (60.0f/REFRESH_RATE);
    temp_r31->vel.y = ((60.0f/REFRESH_RATE) * (1.5f + (0.2f * (0.007874016f * (frand() & 0x7F))))) * 2.0f;
    temp_r31->time = (s32)frand() % 360;
    temp_r31->scale = 20 * scale;
    return i;
}

typedef struct work7C48 {
    s32 unk0;
    s32 unk4;
    s32 unk8;
    float unkC;
    float unk10;
    Vec unk14;
    Vec unk20;
} Work7C48;

void fn_1_7B50(omObjData *object);

void fn_1_7778(omObjData *object)
{
    Work7C48 *workBase = object->data = HuMemDirectMallocNum(HEAP_SYSTEM, sizeof(Work7C48) * 8, MEMORY_DEFAULT_NUM);
    Work7C48 *workP = workBase;
    s32 i;
    memset(workP, 0, 8 * sizeof(Work7C48));
    for (i = 0; i < 8; i++, workP++) {
        switch (i) {
            case 0:
                workP->unk0 = Hu3DModelCreateFile(DATA_MAKE_NUM(DATADIR_M456, 3));
                break;

            case 1:
                workP->unk0 = Hu3DModelCreateFile(DATA_MAKE_NUM(DATADIR_M456, 4));
                break;

            default:
                if (i & 0x1) {
                    workP->unk0 = Hu3DModelLink(workBase[0].unk0);
                }
                else {
                    workP->unk0 = Hu3DModelLink(workBase[1].unk0);
                }
                break;
        }
        Hu3DModelCameraSet(workP->unk0, HU3D_CAM0);
        Hu3DModelLayerSet(workP->unk0, 1);
        workP->unk4 = 0;
        workP->unk8 = 0;
        workP->unkC = 2;
        workP->unk10 = (s32)frand() % 360;
        workP->unk14.x = 1500 * ((0.007874016f * ((s32)frand() & 0x7F)) - 0.5f);
        workP->unk14.z = 500 * ((0.007874016f * ((s32)frand() & 0x7F)) - 0.5f);
        workP->unk14.y = -250 + (100 * (0.3f * i));
        workP->unk20.x = 1500 * ((0.007874016f * ((s32)frand() & 0x7F)) - 0.5f);
        workP->unk20.z = 500 * ((0.007874016f * ((s32)frand() & 0x7F)) - 0.5f);
        workP->unk20.y = workP->unk14.y;
        Hu3DModelPosSet(workP->unk0, workP->unk14.x, workP->unk14.y, workP->unk14.z);
        Hu3DModelRotSet(workP->unk0, 0, workP->unk10, 0);
    }
    object->func = fn_1_7B50;
}

