zeranemesis/Marioparty4/partyboard/src/REL/m456Dll/stage.c
void fn_1_8CB8(HU3DMODEL *model, HU3DPARTICLE *particle, Mtx matrix)
{
    s16 unk8 = 0;
    StructBss90 *workP = lbl_1_bss_90;
    s16 *newWorkP = particle->work;
    s32 unk14 = 0;
    Vec pos = Center;
    Vec rot = CRot;
    float temp_f26;
    float temp_f25;
    float zoom = CZoom;
    HU3DPARTICLEDATA *temp_r31;
    Vec sp3C;
    Vec sp30;
    Vec sp24;
    Vec sp18;
    float temp_f29;
    float temp_f23;
    s32 i;
    switch (newWorkP[2]) {
        case 0:
            temp_r31 = particle->data;
            if (newWorkP[1]) {
                sp18.x = 2000;
                sp18.y = -300;
                sp18.z = 500;
                temp_f29 = 1 / VECMagPoint(sp18.x, sp18.y, sp18.z);
                sp18.x *= temp_f29;
                sp18.y *= temp_f29;
                sp18.z *= temp_f29;
                temp_f23 = 3200.0f / particle->maxCnt;
                for (i = 0; i < particle->maxCnt; i++, temp_r31++) {
                    temp_f26 = 500.0 + ((temp_f23 * i) + ((0.25f * temp_f23) * ((float)((s32)frand() & 0xFFFF) * 0.0000152587890625)));
                    temp_f25 = temp_f26 / 3200;
                    temp_r31->accel.x = temp_f26;
                    temp_r31->pos.x = 1000 + (temp_f26 * sp18.x);
                    temp_r31->pos.y = 4800 + (temp_f26 * sp18.y);
                    temp_r31->pos.z = -3500 + (temp_f26 * sp18.z);
                    temp_r31->scale = ((0.7f * (temp_f25 * temp_f25)) + 0.3f)
                        * (lbl_1_data_7B0[newWorkP[1]] * (0.7f + (0.3f * ((float)((s32)frand() & 0xFFFF) * 0.0000152587890625))));
                    temp_r31->color.r = (s32)(((float)((s32)frand() & 0xFFFF) * 0.0000152587890625) * 160.0) + 32;
                    temp_r31->color.g = (s32)(((float)((s32)frand() & 0xFFFF) * 0.0000152587890625) * 96.0) + 32;
                    temp_r31->color.b = (s32)(((float)((s32)frand() & 0xFFFF) * 0.0000152587890625) * 128.0) + 32;
                    temp_r31->color.a = (255 * lbl_1_data_7C0[newWorkP[1]] * (1.0 - (0.4 * temp_f25)))
                        - (s32)(((float)((s32)frand() & 0xFFFF) * 0.0000152587890625) * 16.0);
                    temp_r31->accel.z = temp_r31->color.a;
                }
                newWorkP[2]++;
            }
            else {
                temp_r31->pos.x = 1000;
                temp_r31->pos.y = 4800;
                temp_r31->pos.z = -3500;
                temp_r31->scale = 1000;
            }
            break;

        case 1:
            sp3C.x = sind(rot.y) * cosd(rot.x);
            sp3C.y = -sind(rot.x);
            sp3C.z = cosd(rot.y) * cosd(rot.x);
            sp30.x = 1000 - (pos.x + (1.25f * (sp3C.x * zoom)));
            sp30.y = 4800 - (pos.y + (sp3C.y * zoom));
            sp30.z = -3500 - (pos.z + (1.25f * (sp3C.z * zoom)));
            temp_f29 = 1 / VECMagPoint(sp30.x, sp30.y, sp30.z);
            sp30.x *= temp_f29;
            sp30.y *= temp_f29;
            sp30.z *= temp_f29;
            temp_f29 = -((-sp30.x * -sp3C.x) + (-sp30.y * -sp3C.y) + (-sp30.z * -sp3C.z));
            sp24.x = -sp3C.x + ((-2.0f * sp30.x) * temp_f29);
            sp24.y = -sp3C.y + ((-2.0f * sp30.y) * temp_f29);
            sp24.z = -sp3C.z + ((-2.0f * sp30.z) * temp_f29);
            temp_r31 = particle->data;
            for (i = 0; i < particle->maxCnt; i++, temp_r31++) {
                temp_r31->pos.x = 1000 + (sp24.x * temp_r31->accel.x);
                temp_r31->pos.y = 4800 + (sp24.y * temp_r31->accel.x);
                temp_r31->pos.z = -3500 + (sp24.z * temp_r31->accel.x);
                temp_r31->color.a = temp_r31->accel.z * workP->unk20.y;
            }
            break;
    }
    DCFlushRange(particle->data, particle->maxCnt * sizeof(HU3DPARTICLEDATA));
}

void fn_1_97FC(float arg0)
{
    StructBss90 *workP = lbl_1_bss_90;
    workP->unk20.y = arg0;
    if (workP->unk20.y > 1.0f) {
        workP->unk20.y = 1.0f;
    }
    if (workP->unk20.y <= 0.0f) {
        Hu3DModelAttrSet(workP->unk10[0], HU3D_ATTR_DISPOFF);
        Hu3DModelAttrSet(workP->unk10[1], HU3D_ATTR_DISPOFF);
        Hu3DModelAttrSet(workP->unk10[2], HU3D_ATTR_DISPOFF);
        Hu3DModelAttrSet(workP->unk10[3], HU3D_ATTR_DISPOFF);
    }
    else {
        Hu3DModelAttrReset(workP->unk10[0], HU3D_ATTR_DISPOFF);
        Hu3DModelAttrReset(workP->unk10[1], HU3D_ATTR_DISPOFF);
        Hu3DModelAttrReset(workP->unk10[2], HU3D_ATTR_DISPOFF);
        Hu3DModelAttrReset(workP->unk10[3], HU3D_ATTR_DISPOFF);
    }
}

float fn_1_9900(float start, float end)
{
    float angleDiff;
    if (start >= 360.0f) {
        start -= 360.0f;
    }
    else if (start < 0.0f) {
        start += 360.0f;
    }
    if (end >= 360.0f) {
        end -= 360.0f;
    }
    else if (end < 0.0f) {
        end += 360.0f;
    }
    angleDiff = start - end;
    if (angleDiff <= -180.0f) {
        angleDiff += 360.0f;
    }
    else if (angleDiff >= 180.0f) {
        angleDiff -= 360.0f;
    }
    return angleDiff;
}

float fn_1_9A18(float start, float end, float max)
{
    float angle;
    float diff;

    if (start >= 360.0) {
        start -= 360.0;
    }
    else if (start < 0.0) {
        start += 360.0;
    }
    if (end >= 360.0) {
        end -= 360.0;
    }
    else if (end < 0.0) {
        end += 360.0;
    }
    diff = 360.0 + (start - end);
    if (fabs(diff) >= 360.0) {
        diff = fmod(diff, 360.0);
    }
    if (diff < 180.0) {
        if (diff <= max) {
            angle = diff;
        }
        else {
            angle = max;
        }
    }
    else if (360.0 - diff <= max) {
        angle = -(360.0 - diff);
    }
    else {
        angle = -max;
    }
    angle += end;
    if (angle >= 360.0) {
        angle -= 360.0;
    }
    else if (angle < 0.0) {
        angle += 360.0;
    }

    return angle;
}
